examples/render_all_grammars/dot/tests_functional_test_scoping_metamodel_provider_utf-16-le_Users.dot
    digraph xtext {
    fontname = "Bitstream Vera Sans"
    fontsize = 8
    node[
        shape=record,
        style=filled,
        fillcolor=aliceblue
    ]
    nodesep = 0.3
    edge[dir=black,arrowtail=empty]


40288104[ label="{Model|}"]

40601096[ label="{User|+name:ID\l}"]

40606040[ label="{Import|+importURI:STRING\l}"]

39811240[ label="{ID|}"]

39817496[ label="{STRING|}"]

40532216[ label="{BOOL|}"]

40537752[ label="{INT|}"]

40543288[ label="{FLOAT|}"]

40548824[ label="{STRICTFLOAT|}"]

40554360[ label="{NUMBER|}"]

39985368[ label="{BASETYPE|}"]

40570104[ label="{*OBJECT|}"]

40435416[ label="{Model|}"]

40363624[ label="{Package|+name:ID\l}"]

40357144[ label="{Interface|+name:ID\l}"]

40553416[ label="{Component|+name:ID\l}"]

40531272[ label="{*Slot|}"]

39816552[ label="{SlotIn|+name:ID\l}"]

39807112[ label="{SlotOut|+name:ID\l}"]

40583960[ label="{Instance|+name:ID\l}"]

40588904[ label="{Connection|}"]

40594440[ label="{FQN|FQN}"]

40547768[ label="{Comment|\\/\\/.*$}"]



40288104 -> 40606040[arrowtail=diamond, dir=both, headlabel="imports 1..*"]
40288104 -> 40601096[arrowtail=diamond, dir=both, headlabel="users 1..*"]
40601096 -> 40583960[headlabel="instance "]
40554360 -> 40548824 [dir=back]
40554360 -> 40537752 [dir=back]
39985368 -> 40554360 [dir=back]
39985368 -> 40543288 [dir=back]
39985368 -> 40532216 [dir=back]
39985368 -> 39811240 [dir=back]
39985368 -> 39817496 [dir=back]
40570104 -> 39985368 [dir=back]
40435416 -> 40363624[arrowtail=diamond, dir=both, headlabel="packages 0..*"]
40363624 -> 40553416[arrowtail=diamond, dir=both, headlabel="components 1..*"]
40363624 -> 40583960[arrowtail=diamond, dir=both, headlabel="instances 1..*"]
40363624 -> 40588904[arrowtail=diamond, dir=both, headlabel="connections 1..*"]
40363624 -> 40363624[arrowtail=diamond, dir=both, headlabel="packages 1..*"]
40363624 -> 40357144[arrowtail=diamond, dir=both, headlabel="interfaces 1..*"]
40553416 -> 40553416[headlabel="extends 1..*"]
40553416 -> 40531272[arrowtail=diamond, dir=both, headlabel="slots 0..*"]
40531272 -> 39816552 [dir=back]
40531272 -> 39807112 [dir=back]
39816552 -> 40357144[headlabel="formats 1..*"]
39807112 -> 40357144[headlabel="formats 1..*"]
40583960 -> 40553416[headlabel="component "]
40588904 -> 40583960[headlabel="from_inst "]
40588904 -> 39807112[headlabel="from_port "]
40588904 -> 40583960[headlabel="to_inst "]
40588904 -> 39816552[headlabel="to_port "]

}
